# parameters
nc: 1  # number of classes
nkpt: 17 # number of keypoints
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.25  # layer channel multiple
dw_conv_kpt: True

# anchors
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32
# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  [ [ -1, 1, Focus, [ 64, 3 ] ],  # 0-P1/2 
    [ -1, 1, Conv, [ 128, 3, 2 ] ],  # 1-P2/4
    [ -1, 3, C3Ghost, [ 128 ] ],
    [ -1, 1, Conv, [ 256, 3, 2 ] ],  # 3-P3/8
    [ -1, 3, C3Ghost, [ 256 ] ],
    [ -1, 1, Conv, [ 512, 3, 2 ] ],  # 5-P4/16
    [ -1, 3, C3Ghost, [ 512 ] ],

    [ -1, 1, SPP, [ 512, [3, 5, 7]] ], #7
  ]

# YOLOv5 head
head:
  [ [-1, 1, Conv, [512, 1, 1]],
    [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone 4-p3/8
   [-1, 3, C3Ghost, [512, False]],  # 11
   
   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 2], 1, Concat, [1]], # cat backbone 2-p2/4
   [-1,3, C3Ghost, [256, False]], #15
   
   [-1, 1, Conv, [256, 3, 2]],
#    [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 12], 1, Concat, [1]],  # cat head 12-p3/8
   [-1, 3, C3Ghost, [256, False]],  # 18 (P3-8)
   
   [-1, 1, Conv, [512, 3, 2]],
   [[-1,8], 1, Concat, [1]], # cat head 8-p4/16
   [-1, 3, C3Ghost, [512, False]], # 21 (p4/16)

    [ [ 15, 18, 21], 1, Detect, [ nc, anchors, nkpt ] ],  # Detect(p2, P3, P4)
  ]
